In [1]:
import pandas as pd
import numpy as np

In [3]:
datam=[1,2,3,4,5,6,7,8]

In [4]:
pd.DataFrame(datam,columns=["sayılar"])

   sayılar
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8

In [8]:
m=np.arange(1,10).reshape((3,3))

In [13]:
df=pd.DataFrame(m,columns=["var1","var2","var3"])

In [14]:
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [15]:
df.sample()  # 1 tane random örnek geldi

   var1  var2  var3
0     1     2     3

In [16]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [17]:
df.columns=['sütun1', 'sütun2', 'sütun3']

In [18]:
df

   sütun1  sütun2  sütun3
0       1       2       3
1       4       5       6
2       7       8       9

In [19]:
df.shape

(3, 3)

In [20]:
df.values  # değerleri liste şeklinde getirdi.

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

# dict ile df

In [27]:
s1=np.random.randint(10, size=5)
s2=np.random.randint(10, size=5)
s3=np.random.randint(10, size=5)

In [28]:
mdict={"var1":s1,"var2":s2,"var3":s3}

In [36]:
df1=pd.DataFrame(mdict)

In [37]:
df1.head()

   var1  var2  var3
0     0     0     6
1     3     4     6
2     7     6     5
3     6     4     9
4     4     8     1

In [32]:
df3=pd.read_csv("ornek.csv")

In [33]:
df3

     a   b     c
0   10  12   3.0
1   11  33  34.0
2   44  51   NaN
3   10  12   4.0
4   11  33  35.0
5   44  51   0.0
6   10  12   5.0
7   11  33  36.0
8   44  51  25.0
9   10  12   6.0
10  11  33  37.0
11  44  51   NaN
12  10  12   7.0
13  11  33  38.0
14  44  51   NaN

In [38]:
df1[1:3]

   var1  var2  var3
1     3     4     6
2     7     6     5

In [40]:
df1.index=["a","b","c","d","e"]  # indexe atamt yaptı

In [41]:
df1

   var1  var2  var3
a     0     0     6
b     3     4     6
c     7     6     5
d     6     4     9
e     4     8     1

In [42]:
df1["a":"d"]  # indexte d dahil oldu önemli

   var1  var2  var3
a     0     0     6
b     3     4     6
c     7     6     5
d     6     4     9

In [43]:
"a b c d e ".split()

['a', 'b', 'c', 'd', 'e']

In [47]:
np.random.randn(5,4)

array([[ 0.30266545,  1.69372293, -1.70608593, -1.15911942],
       [-0.13484072,  0.39052784,  0.16690464,  0.18450186],
       [ 0.80770591,  0.07295968,  0.63878701,  0.3296463 ],
       [-0.49710402, -0.7540697 , -0.9434064 ,  0.48475165],
       [-0.11677332,  1.9017548 ,  0.23812696,  1.99665229]])

In [49]:
np.random.seed(101)
df3=pd.DataFrame(np.random.randn(5,4),index="a b c d e ".split(),columns="x y z w".split())
df3

          x         y         z         w
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [52]:
type(df3["w"])   # sütun komple geldi seri dir gelen

pandas.core.series.Series

In [53]:
type(df3[["w"]])  # sütun komple geldi dataframe dir gelen

pandas.core.frame.DataFrame

In [55]:
df3[["w","z"]]   # iki ifade alacaksan 2 parantez kullan

          w         z
a  0.503826  0.907969
b  0.605965 -0.848077
c -0.589001  0.528813
d  0.955057 -0.933237
e  0.683509  2.605967

In [56]:
df3["yeni_sütun"]=df3["w"]+df3["z"]  # yeni kolon ekledik iki sonra birleştirdik

In [57]:
df3

          x         y         z         w  yeni_sütun
a  2.706850  0.628133  0.907969  0.503826    1.411795
b  0.651118 -0.319318 -0.848077  0.605965   -0.242112
c -2.018168  0.740122  0.528813 -0.589001   -0.060187
d  0.188695 -0.758872 -0.933237  0.955057    0.021819
e  0.190794  1.978757  2.605967  0.683509    3.289476

In [61]:
df3["yepyeni"]=df3["x"]*df3["y"]
df3

          x         y         z         w  yeni_sütun   yepyeni
a  2.706850  0.628133  0.907969  0.503826    1.411795  1.700261
b  0.651118 -0.319318 -0.848077  0.605965   -0.242112 -0.207914
c -2.018168  0.740122  0.528813 -0.589001   -0.060187 -1.493691
d  0.188695 -0.758872 -0.933237  0.955057    0.021819 -0.143196
e  0.190794  1.978757  2.605967  0.683509    3.289476  0.377536

# dropping

In [62]:
df3.drop(["yeni_sütun","yepyeni"],axis=1)# sütun bazlı çalışacak inplace yapmadık kalıcı olmaz

          x         y         z         w
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [63]:
df3

          x         y         z         w  yeni_sütun   yepyeni
a  2.706850  0.628133  0.907969  0.503826    1.411795  1.700261
b  0.651118 -0.319318 -0.848077  0.605965   -0.242112 -0.207914
c -2.018168  0.740122  0.528813 -0.589001   -0.060187 -1.493691
d  0.188695 -0.758872 -0.933237  0.955057    0.021819 -0.143196
e  0.190794  1.978757  2.605967  0.683509    3.289476  0.377536

In [64]:
df3.drop(["yeni_sütun","yepyeni"],axis=1,inplace=True)# sütun bazlı çalışacak inplace yapmadık kalıcı olmaz

In [66]:
df3.drop("c",axis=0)  # c indexli satırı sildi

          x         y         z         w
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [68]:
df3

          x         y         z         w
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

# loc ve iloc

In [70]:
m = np.random.randint(1,30, size = (10,3))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df4

   var1  var2  var3
0     4    11    20
1    29     8    21
2    28     9    23
3    27    27    20
4    24    15    16
5    23     6    23
6    10    14     3
7    19    27    16
8    29    12    28
9    11    18     4

In [73]:
df4.loc[1] # tek indexe baktık ilk satır

var1    29
var2     8
var3    21
Name: 1, dtype: int32

In [74]:
df4.loc[1:4]  # 4 dahil

   var1  var2  var3
1    29     8    21
2    28     9    23
3    27    27    20
4    24    15    16

In [76]:
df4.iloc[1]  # 4 hariç

var1    29
var2     8
var3    21
Name: 1, dtype: int32

In [77]:
"a b c d e f g h i j".split()

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [81]:
df4.index="a b c d e f g h i j".split()  # index noları değişti.

In [86]:
df4.loc["a":"f"][["var2"]]  # a dan f ye var2 kolonu

   var2
a    11
b     8
c     9
d    27
e    15
f     6

In [87]:
df.iloc[1:5]["var2"] # satırlar bir yerde sütunlar bir yerde

1    4
2    6
3    4
4    8
Name: var2, dtype: int32

In [88]:
# index nosu her nekadar a olsa da gerçek index olacak

TypeError: Cannot index by location index with a non-integer key

In [89]:
df3.iloc[1]

x    0.651118
y   -0.319318
z   -0.848077
w    0.605965
Name: b, dtype: float64

In [90]:
df3.info() # colon adı x  z w

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       5 non-null      float64
 1   y       5 non-null      float64
 2   z       5 non-null      float64
 3   w       5 non-null      float64
dtypes: float64(4)
memory usage: 360.0+ bytes

In [95]:
df3.iloc[:,[2]]  # tüm satırlar 2. sütun köşeli parentez df yaptı

          z
a  0.907969
b -0.848077
c  0.528813
d -0.933237
e  2.605967

In [98]:
df3

          x         y         z         w
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [97]:
df3[df3["w"]>0]["y"]  # w 0 dan büyük y sütununu getir

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: y, dtype: float64

In [102]:
df3[df3["w"]>0][["y","z"]]  # w 0 dan büyük y ve z sütununu getir

          y         z
a  0.628133  0.907969
b -0.319318 -0.848077
d -0.758872 -0.933237
e  1.978757  2.605967

In [106]:
df3[(df3["w"]>0) & (df3["y"]>1)]

          x         y         z         w
e  0.190794  1.978757  2.605967  0.683509

In [107]:
#reset index

In [109]:
df3.reset_index()  # gerçek index e dön

  index         x         y         z         w
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [110]:
df3.reset_index(drop=True)  # az önceki index i sildi kalıcı değil............

          x         y         z         w
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [112]:
new_index="CA NY WY OR CO".split()
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [116]:
df3["states"]=new_index
df3         # yeni sütun ekledik ve değer verdik içine veri gönderdik eşit

          x         y         z         w states
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     NY
c -2.018168  0.740122  0.528813 -0.589001     WY
d  0.188695 -0.758872 -0.933237  0.955057     OR
e  0.190794  1.978757  2.605967  0.683509     CO

In [123]:
df3.set_index("states",inplace=True)  # indis oldu

KeyError: "None of ['states'] are in the columns"

In [124]:
df3   # atamayı yaptı kalıcı oldu

               x         y         z         w
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [125]:
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2']
inside = [1, 2, 3, 1, 2, 3]
multi_index = list(zip(outside, inside))
multi_index                                # zipledi

[('M1', 1), ('M1', 2), ('M1', 3), ('M2', 1), ('M2', 2), ('M2', 3)]

In [131]:
hier_index=pd.MultiIndex.from_tuples(multi_index)  # multi index
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3)],
           )

In [132]:
df5=pd.DataFrame(np.random.rand(6,2),index=hier_index)

In [133]:
df5

             0         1
M1 1  0.344376  0.984223
   2  0.240097  0.162188
   3  0.573844  0.276268
M2 1  0.403053  0.179195
   2  0.270089  0.869634
   3  0.582973  0.379542

In [136]:
df5.loc["M1"]

          0         1
1  0.344376  0.984223
2  0.240097  0.162188
3  0.573844  0.276268

In [137]:
df5.loc["M1"].loc[[1]]

          0         1
1  0.344376  0.984223

In [139]:
df5.xs(("M1",1))  # xs te ilgili sütunu getirir

0    0.344376
1    0.984223
Name: (M1, 1), dtype: float64

In [140]:
df5.xs(("M1",1))  # xs te ilgili sütunu getirir

0    0.344376
1    0.984223
Name: (M1, 1), dtype: float64

In [141]:
import seaborn as sns

In [142]:
df= sns.load_dataset("planets")

In [151]:
df.head()

            method  orbital_period   mass  distance  year
0  Radial Velocity         269.300   7.10     77.40  2006
1  Radial Velocity         874.774   2.21     56.95  2008
2  Radial Velocity         763.000   2.60     19.84  2011
3  Radial Velocity         326.030  19.40    110.62  2007
4  Radial Velocity         516.220  10.50    119.47  2009

In [145]:
df.shape

(1035, 6)

In [150]:
df.tail

<bound method NDFrame.tail of                method  orbital_period   mass  distance  year
0     Radial Velocity      269.300000   7.10     77.40  2006
1     Radial Velocity      874.774000   2.21     56.95  2008
2     Radial Velocity      763.000000   2.60     19.84  2011
3     Radial Velocity      326.030000  19.40    110.62  2007
4     Radial Velocity      516.220000  10.50    119.47  2009
...               ...             ...    ...       ...   ...
1030          Transit        3.941507    NaN    172.00  2006
1031          Transit        2.615864    NaN    148.00  2007
1032          Transit        3.191524    NaN    174.00  2007
1033          Transit        4.125083    NaN    293.00  2008
1034          Transit        4.187757    NaN    260.00  2008

[1035 rows x 5 columns]>

In [147]:
df.iloc[1:5,2:4]  # sondaki dahil değil.

   orbital_period   mass
1         874.774   2.21
2         763.000   2.60
3         326.030  19.40
4         516.220  10.50

In [153]:
df.drop("number",axis=1)
df

KeyError: "['number'] not found in axis"

In [155]:
df[(df["mass"]>3)&(df["distance"]>180)]

              method  orbital_period  mass  distance  year
161  Radial Velocity           428.5  15.2    214.00  2009
181  Radial Velocity          1022.0   3.4    354.00  2011
245  Radial Velocity           471.6  14.0    300.30  2005
396  Radial Velocity           647.3   4.0    221.24  2011
563  Radial Velocity          4885.0   3.1    189.39  2009
587  Radial Velocity           875.5   9.9    352.11  2012
610  Radial Velocity           672.1  11.1    289.02  2012
620  Radial Velocity           745.7   5.3    307.69  2011